#Область ПрограммныйИнтерфейс

// Подключает Vanessa Automation Single как внешнюю обработку на сервере приложения.
//
// Параметры:
//  АдресХранилища - Строка - адрес временного хранилища файла epf.
//
// Возвращаемое значение:
//  Строка - внутреннее имя подключенной внешней обработки.
Функция ПодключитьVanessaAutomationSingleНаСервере(АдресХранилища) Экспорт

	ОписаниеЗащитыОтОпасныхДействий = Новый ОписаниеЗащитыОтОпасныхДействий;
	ОписаниеЗащитыОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;

	Возврат ВнешниеОбработки.Подключить(АдресХранилища, , Ложь, ОписаниеЗащитыОтОпасныхДействий);

КонецФункции

#КонецОбласти
