#Область ПрограммныйИнтерфейс

Функция ДанныеОбъектаСервер(ТекОбъект) Экспорт
	
	Попытка
		СсылкаОбъекта = ТекОбъект.Ссылка;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	ТипОбъекта = ТипЗнч(СсылкаОбъекта);
	ОМ = Метаданные.НайтиПоТипу(ТипОбъекта);
	
	Результат = Новый Структура;	
	Результат.Вставить("СтандартныеРеквизиты", ПолучитьЗначенияРеквизитовОбъекта(ОМ.СтандартныеРеквизиты, ТекОбъект));
	Результат.Вставить("РеквизитыШапки", ПолучитьЗначенияРеквизитовОбъекта(ОМ.Реквизиты, ТекОбъект));
	
	ТабличныеЧасти = Новый Массив;
	Результат.Вставить("ТабличныеЧасти", ТабличныеЧасти);
	Для Каждого ТекТабличнаяЧасть Из ОМ.ТабличныеЧасти Цикл
		ДанныеТабличнойЧасти = Новый Структура;
		ДанныеТабличнойЧасти.Вставить("Имя", ТекТабличнаяЧасть.Имя);
		ДанныеТабличнойЧасти.Вставить("ЗначениеТаблицы", ПолучитьЗначениеТаблицыЗначений(ОМ.ТабличныеЧасти[ТекТабличнаяЧасть.Имя], ТекОбъект[ТекТабличнаяЧасть.Имя]));
		ТабличныеЧасти.Добавить(ДанныеТабличнойЧасти);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьЗначенияРеквизитовОбъекта(РеквизитыОМ, ТекОбъект)
	
	Результат = Новый Массив;
	Для Каждого Элем Из РеквизитыОМ Цикл
		Попытка
			Значение = ТекОбъект[Элем.Имя];
		Исключение
			Продолжить;
		КонецПопытки;
		
		ДанныеРеквизита = Новый Структура;
		ДанныеРеквизита.Вставить("Имя", Элем.Имя);
		Если ТипЗнч(Значение) = Тип("Число") Тогда
			ЗначениеСтрокой = XMLСтрока(Значение);
			ДанныеРеквизита.Вставить("Значение", ЗначениеСтрокой);
		ИначеЕсли ТипЗнч(Значение) = Тип("Строка") Тогда
			ДанныеРеквизита.Вставить("Значение", Значение);
		ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда
			ДанныеРеквизита.Вставить("Значение", Значение);
		ИначеЕсли ТипЗнч(Значение) = Тип("Булево") Тогда
			ДанныеРеквизита.Вставить("Значение", Значение);
		ИначеЕсли ТипЗнч(Значение) = Тип("Неопределено") Тогда
			ДанныеРеквизита.Вставить("Значение", Значение);
		Иначе
			// Ссылочые типы преобразовываем к строке
			ДанныеРеквизита.Вставить("Значение", Строка(Значение));
		КонецЕсли;	
		ДанныеРеквизита.Вставить("Тип", СтроковоеПредставлениеТипа(ТипЗнч(Значение)));
		
		Результат.Добавить(ДанныеРеквизита);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции	

&НаСервере
Функция ПолучитьЗначениеТаблицыЗначений(ОМТабличнаяЧасть, ОбъектТабличнаяЧасть)
	
	Результат = Новый Массив;
	Для Каждого СтрокаОбъектТабличнаяЧасть Из ОбъектТабличнаяЧасть Цикл
		ДанныеСтрокиТЧ = ПолучитьЗначенияРеквизитовОбъекта(ОМТабличнаяЧасть.Реквизиты, СтрокаОбъектТабличнаяЧасть);
		СтандартныеРеквизиты = ПолучитьЗначенияРеквизитовОбъекта(ОМТабличнаяЧасть.СтандартныеРеквизиты, СтрокаОбъектТабличнаяЧасть);
		Для Каждого ТекСтандартныйРеквизит Из СтандартныеРеквизиты Цикл
			ДанныеСтрокиТЧ.Добавить(ТекСтандартныйРеквизит);
		КонецЦикла;
		Результат.Добавить(ДанныеСтрокиТЧ);
	КонецЦикла;	
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция СтроковоеПредставлениеТипа(Тип) Экспорт
	
	Представление = "";
	
	Если ЭтоСсылка(Тип) Тогда
	
		ПолноеИмя = Метаданные.НайтиПоТипу(Тип).ПолноеИмя();
		ИмяОбъекта = СтрРазделить(ПолноеИмя, ".")[1];
		
		Если Справочники.ТипВсеСсылки().СодержитТип(Тип) Тогда
			Представление = "СправочникСсылка";
		
		ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(Тип) Тогда
			Представление = "ДокументСсылка";
		
		ИначеЕсли БизнесПроцессы.ТипВсеСсылки().СодержитТип(Тип) Тогда
			Представление = "БизнесПроцессСсылка";
		
		ИначеЕсли БизнесПроцессы.ТипВсеСсылкиТочекМаршрутаБизнесПроцессов().СодержитТип(Тип) Тогда
			Представление = "ТочкаМаршрутаБизнесПроцессаСсылка";
		
		ИначеЕсли ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(Тип) Тогда
			Представление = "ПланВидовХарактеристикСсылка";
		
		ИначеЕсли ПланыСчетов.ТипВсеСсылки().СодержитТип(Тип) Тогда
			Представление = "ПланСчетовСсылка";
		
		ИначеЕсли ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(Тип) Тогда
			Представление = "ПланВидовРасчетаСсылка";
		
		ИначеЕсли Задачи.ТипВсеСсылки().СодержитТип(Тип) Тогда
			Представление = "ЗадачаСсылка";
		
		ИначеЕсли ПланыОбмена.ТипВсеСсылки().СодержитТип(Тип) Тогда
			Представление = "ПланОбменаСсылка";
		
		ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(Тип) Тогда
			Представление = "ПеречислениеСсылка";
		
		КонецЕсли;
		
		Результат = ?(Представление = "", Представление, Представление + "." + ИмяОбъекта);
		
	ИначеЕсли Тип = Тип("Неопределено") Тогда
		Результат = "Неопределено";
		
	ИначеЕсли Тип = Тип("Строка") Тогда
		Результат = "Строка";

	ИначеЕсли Тип = Тип("Число") Тогда
		Результат = "Число";

	ИначеЕсли Тип = Тип("Булево") Тогда
		Результат = "Булево";

	ИначеЕсли Тип = Тип("Дата") Тогда
		Результат = "Дата";
	
	Иначе
		
		Результат = Строка(Тип);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЭтоСсылка(ПроверяемыйТип) Экспорт
	
	Возврат ПроверяемыйТип <> Тип("Неопределено") И ОписаниеТипаВсеСсылки().СодержитТип(ПроверяемыйТип);
	
КонецФункции

&НаСервере
Функция ОписаниеТипаВсеСсылки() Экспорт
	
	Возврат Новый ОписаниеТипов(Новый ОписаниеТипов(Новый ОписаниеТипов(Новый ОписаниеТипов(Новый ОписаниеТипов(
		Новый ОписаниеТипов(Новый ОписаниеТипов(Новый ОписаниеТипов(Новый ОписаниеТипов(
			Справочники.ТипВсеСсылки(),
			Документы.ТипВсеСсылки().Типы()),
			ПланыОбмена.ТипВсеСсылки().Типы()),
			Перечисления.ТипВсеСсылки().Типы()),
			ПланыВидовХарактеристик.ТипВсеСсылки().Типы()),
			ПланыСчетов.ТипВсеСсылки().Типы()),
			ПланыВидовРасчета.ТипВсеСсылки().Типы()),
			БизнесПроцессы.ТипВсеСсылки().Типы()),
			БизнесПроцессы.ТипВсеСсылкиТочекМаршрутаБизнесПроцессов().Типы()),
			Задачи.ТипВсеСсылки().Типы());
	
КонецФункции

#КонецОбласти