#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	ОбработкаВыполнена = Ложь;
	ТекстИсключения = "";
	ЗначениеРезультат = "";
	
	Попытка
	
		Окна = ПолучитьОкна();
		Для Каждого ТекОкно Из Окна Цикл
			Если НРег(ТекОкно.Заголовок) <> НРег(ЗаголовокОкна) Тогда
				Продолжить;
			КонецЕсли;
			
			ТекФорма = ТекОкно.Содержимое[0];
			ДанныеОбъекта = ДанныеОбъекта(ТекФорма);
			ЗначениеРезультат = ЗаписатьОбъектJSON(ДанныеОбъекта);
		КонецЦикла;	
	Исключение
		ТекстИсключения = ОписаниеОшибки();
	КонецПопытки;
	
	ОбработкаВыполнена = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПрочитатьОбъектJSON(ДанныеJSON, ПрочитатьВСоответствие = Ложь)
	
	ЧтениеJSON = New ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ДанныеJSON);
	Значение = ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие);
	ЧтениеJSON.Закрыть();
	Возврат Значение;
	
КонецФункции	 

&НаКлиенте
Функция ЗаписатьОбъектJSON(ДанныеJSON) Экспорт
	#Если НЕ ВебКлиент Тогда

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеJSON);
	Возврат ЗаписьJSON.Закрыть();
	
	#КонецЕсли
КонецФункции

&НаСервере
Функция ДанныеОбъектаСервер(ТекОбъект)
	Возврат VAExtensionОбщегоНазначенияСервер.ДанныеОбъектаСервер(ТекОбъект);
КонецФункции

&НаКлиенте
Функция ДанныеОбъекта(ТекФорма)
	ТекОбъект = Неопределено;
	Попытка
		ТекОбъект = ТекФорма.Объект;
	Исключение
	КонецПопытки;
	
	Если ТекОбъект = Неопределено Тогда
		Попытка
			ТекОбъект = ТекФорма.Object;
		Исключение
		КонецПопытки;
	КонецЕсли;	
	
	Если ТекОбъект = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ДанныеОбъектаСервер(ТекОбъект);
	
КонецФункции	

#КонецОбласти